app/controllers/users_controller.rb

    def addpoints
      @user = current_user
      @user.winpoints += 10
      current_user.save
---
UPDATE "users" SET "winpoints" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["winpoints", 10], ["updated_at", "2021-01-25 15:56:19.266065"], ["id", 1]]